# Task #1
# Таблица умножения
# Напишите программу, которая выводит таблицу умножения для чисел от 1 до n.
# Где n это число, которое введет пользователь.
# Оформите вывод так, чтобы столбцы были ровные (число ровно под числом)
#
# Пример вывода:
# Введите число: 5

# n = int(input("Введите число: "))
#
# for i in range(1, n + 1):
#     for j in range(1, n + 1):
#         print(i * j, end="\t")
#     print()
#
# #Task #2
# # Напишите программу, которая принимает число n и выводит "лестницу" из чисел.
# # Каждая строка лестницы содержит числа от 1 до номера строки.
# # Пример вывода:
# # Введите число: 5
#
# # 1
# # 1 2
# # 1 2 3
# # 1 2 3 4
# # 1 2 3 4 5
#
# n = int(input("Введите число: "))
# for i in range(1, n + 1):
#     for j in range(1, i + 1):
#         print(j , end="\t")
#     print()
#
#
#
#
#
#
# # Task III
# products = [
#  ("Кофе", 127.99),
#  ("Чай", 52.49),
#  ("Шоколад", 81.99)
# ]
#
# discount = int(input("Введите процент скидки: "))
#
# print("Название | Цена | Скидка |Итоговая цена")
# for item in products:
#     product, price = item
#     print(f"{product:>10} | {price:>10} | {discount:>10} | {price * (1 - (discount/100)):>10}")
#
#
#

# clients = [
#     ("Иван", "Иванов", 10, [("Кофе", 100.00), ("Чай", 200.00)]),
#     ("Анна", "Смирнова", 15, [("Шоколад", 150.00), ("Печенье", 50.00)]),
#     ("Петр", "Сидоров", 20, [("Чайник", 1000.00), ("Кружка", 300.00)])
# ]
#
# for item in clients:
#     name, lastname, discount, purchase = item
#     print("""Уважаемый {0} {1},
#
# Спасибо за покупку в нашем магазине!
#
# Вы купили следующие товары:
#  - {3[0]}
#  - {3[1}
#
# Общая сумма покупок: {3[2][2]}
# Ваша скидка: {2}
# Сумма с учётом скидки:
#
# Благодарим за покупку!""".format(name, lastname, discount, purchase))
#
#
#
#
# #task #5
#
# clients = [
#     ("Иван", "Иванов", 10, [("Кофе", 100.00), ("Чай", 200.00)]),
#     ("Анна", "Смирнова", 15, [("Шоколад", 150.00), ("Печенье", 50.00)]),
#     ("Петр", "Сидоров", 20, [("Чайник", 1000.00), ("Кружка", 300.00)])
# ]
#
# for item in clients:
#     name, lastname, discount, purchase = item
#     data = []
#     total = 0
#     for product, price in purchase:
#         data.append(f"- {product}: {price}")
#         total += price
#     data = "\n".join(data)
#     print(f"""Уважаемый {name} {lastname},
#
# Спасибо за покупку в нашем магазине!
#
# Вы купили следующие товары:
# {data}
#
# Общая сумма покупок: {total}
# Ваша скидка: {discount}
# Сумма с учётом скидки: {total * (1 - discount / 100)}
#
# Благодарим за покупку!""")
#
# # Task V
#
# clients = [
#     ("Иван", "Иванов", 10, [("Кофе", 100.00), ("Чай", 200.00)]),
#     ("Анна", "Смирнова", 15, [("Шоколад", 150.00), ("Печенье", 50.00)]),
#     ("Петр", "Сидоров", 20, [("Чайник", 1000.00), ("Кружка", 300.00)])
# ]
#
# for item in clients:
#     name, lastname, discount, purchase = item
#     product1, product2 = purchase
#     good1, price1 = product1
#     good2, price2 = product2
#     print(f"""Уважаемый {name} {lastname},
#
# Спасибо за покупку в нашем магазине!
#
# Вы купили следующие товары:
#  - {good1}: {price1}
#  - {good2}: {price2}
#
# Общая сумма покупок: {price1 + price2}
# Ваша скидка: {discount}
# Сумма с учётом скидки: {(price1 + price2) * (1 - discount / 100)}
#
# Благодарим за покупку!""")



#tast #6
f"Сумма положительных чисел: ${res:,.2f}"
# Task VI

employees = [
 ("Иван", "Иванов", "Менеджер", 1600),
 ("Мария", "Петрова", "Аналитик", 2000),
 ("Сергей", "Сидоров", "Разработчик", 2400),
 ("Анна", "Смирнова", "Дизайнер", 1750)
]
print("Имя Фамилия Должность Зарплата")
data = []
div = 0
summe = 0
for item in employees:
    name, lastname, job, salary = item
    print(f"{name:>15}, {lastname:>15}, {job:>20}, {salary:>10}")
    summe += salary
    div += 1

print(f"""ИТОГО {summe:,.2f}
Средняя зарплата {summe/div}""")