#---------------------------------------------------Task_#1-------------------------------------------------------------
#----------------------------------------------Сумма цифр числа---------------------------------------------------------
# Напишите рекурсивную функцию, которая находит сумму всех цифр числа.

# Данные:
num = 43197
# Пример вывода:
# 24

def sum_number(num: int) -> int:

    """
    Рекурсивно находит сумму всех цифр числа.

    :param num: Целое число.
    :return: Сумма цифр.
    """

    if num == 0:
        return 0
    return num % 10 + sum_number(num // 10)

print(sum_number(num))

#------------------------------------------------Task_#3----------------------------------------------------------------
#------------------------------------------Сумма вложенных чисел--------------------------------------------------------
# Напишите рекурсивную функцию, которая суммирует все числа во вложенных списках.
#
# Данные:
# nested_numbers = [1, [2, 3], [4, [5, 6]], 7]
# Пример вывода:
# 28

nested_numbers = [1, [2, 3], [4, [5, 6]], 7]

def sum_nested(data: list) -> int:

    """
    Рекурсивно суммирует все числа во вложенных списках.

    :param data: Список с числами и вложенными списками
    :return: Сумма всех чисел
    """

    total = 0
    for item in data:
        if isinstance(item, list):
            total += sum_nested(item)
        else:
            total += item
    return total

print(sum_nested(nested_numbers))

#-----------------------------------------------------------------------------------------------------------------------