# --------------------------------------------------Task #1----------------------------------------------------------

# Не уникальные числа
# Напишите программу, которая находит все числа, встречающиеся более одного раза в списке, и выводит их в порядке убывания.
# Данные:
# numbers = [4, 7, 3, 7, 8, 3, 4, 2, 7, 3, 8, 4]
# Пример вывода:
# Числа, встречающиеся более одного раза: [7, 4, 3, 8]
#--------------------------------------------------------------------------------------------------------------------
numbers = [4, 7, 3, 7, 8, 3, 4, 2, 7, 3, 8, 4]
# new_list = []

# for item in numbers:
#     if numbers.count(item) > 1:
#         new_list.append(item)
#         new_list = sorted(new_list, reverse=True)
# set_list = (set(new_list))
#
# print(list(set_list))
#--------------------------------------------set compr----------------------------------------------------------------
# set_list = {item for item in numbers if numbers.count(item) > 1}
# set_list = sorted(set_list, reverse=True)
# print(set_list)
#--------------------------------------------------------------------------------------------------------------------
# Через словарь

count_dict = {}
for item in numbers:
    if item in count_dict:
        count_dict[item] += 1
    else:
        count_dict[item] = 1

result = []

for key in count_dict:
    if count_dict[key] > 1:
        result.append(key)

result = sorted(result, reverse=True)
print(f'Числа, встречающиеся более одного раза: {result}')

#----------------------------------------------Task #2------------------------------------------------------------------
# Проверка подмножества
# Задача: Напишите программу, которая проверяет, является ли один словарь подмножеством другого
# (т.е. все его пары "ключ-значение" содержатся в другом словаре).

# Данные:
dict1 = {"a": 1, "b": 2}
dict2 = {"a": 1, "b": 2, "c": 3}

# Пример вывода:
# Первый словарь является подмножеством второго.

is_subset = True

for key in dict1:
    if key not in dict2 or dict1[key] != dict2[key]:
        is_subset = False
        break
if is_subset:
    print('Первый словарь является подмножеством второго.')
else:
    print('Не является подмножеством.')


