#Task #1
# Одно слово
# Напишите программу, которая обрабатывает список из строк и удаляет все строки,
# содержащие более одного слова, а также преобразует оставшиеся строки к нижнему регистру.
#
# Данные:
# text_list = ["Hello", "Python Programming", "World", "Advanced Topics", "Simple"]
#
# Пример вывода:
# Обработанный список: ['hello', 'world', 'simple']

text_list = ["Hello", "Python Programming", "World", "Advanced Topics", "Simple"]

result = []

for i in range(len(text_list)):
    if " " not in text_list[i]:
        result.append(text_list[i].lower())

print(result)

#-----------------------------------------------------------------------------------------------------------------------

#Task #2
# Обновление цен товаров
#
# Дан список товаров с ценами. Программа должна применить скидку к каждому товару и добавить в список элемент с новой ценой.
# В конце вывести таблицу с новой ценой.
#
# Данные:
# products = [["Laptop", 1200], ["Mouse", 25], ["Keyboard", 75], ["Monitor", 200]]
# Пример вывода:
# Введите скидку (в процентах): 17
#
# Товар          Старая цена    Новая цена
#
# Laptop            1200.00$       996.00$
#
# Mouse                25.00$         20.75$
#
# Keyboard           75.00$         62.25$
#
# Monitor            200.00$       166.00$

products = [["Laptop", 1200], ["Mouse", 25], ["Keyboard", 75], ["Monitor", 200]]

sale = int(input('Введите скидку (в процентах): '))
a = 0
print(f'{'Товар'}{'Старая цена':>20}{'Новая цена':>14}')
for item in products:
    new_price = item[1] - (item[1] * (sale / 100))
    print(f'{item[0]} {item[1]:>17.2f}$ {new_price:>10.2f}$')

#-----------------------------------------------------------------------------------------------------------------------




