#---------------------------------------------------Task_#1-------------------------------------------------------------
#----------------------------------------------Деление без ошибок-------------------------------------------------------
# Напишите функцию, которая выполняет деление двух чисел, введенных пользователем, и обрабатывает возможные ошибки.
#
# Пример вывода:
# Введите делимое: 345
# Введите делитель: 5a
# Ошибка: Введено некорректное число.

def division_num(a: float, b: float) -> float:

    """
    Divides two numbers and returns the result.

    :param a: Dividend.
    :param b: Divisor.
    :return: Division result.
    """

    return a / b


try:
    dividend = float(input("Введите делимое: "))
    divisor = float(input("Введите делитель: "))

    result = division_num(dividend, divisor)

except ValueError:
    print("Ошибка: Введено некорректное число.")

except ZeroDivisionError:
    print("Ошибка: Деление на ноль невозможно.")

else:
    print(f"Результат: {result}")

#------------------------------------------------Task_#2----------------------------------------------------------------
#-------------------------------------------Логирование ошибок----------------------------------------------------------
# Перенаправьте в предыдущей задаче вывод ошибок в файл errors.log в соответствии с форматом ниже.
#
# Пример вывода:
# 2025-02-23 22:38:53,686 - ERROR - test.py - 16 - Ошибка: Введено некорректное число.

import logging
logging.basicConfig(
    filename="errors.log",
    level=logging.ERROR,
    format="%(asctime)s - %(levelname)s - %(filename)s - %(lineno)d - %(message)s"
)

def division_num():
    try:
        a = float(input("Введите делимое: "))
        b = float(input("Введите делитель: "))
        result = a / b
        print(f"Результат: {result}")

    except ValueError:
        logging.error("Ошибка: Введено некорректное число.")
    except ZeroDivisionError:
        logging.error("Ошибка: Деление на ноль невозможно.")

division_num()

#------------------------------------------------------------------------------------------------------------------------