# task #1
# Логические операции
# Напишите программу, которая получит два логических значения от пользователя и выведет результат логических операций
# and, or, not для этих значений, а также сравнение на равенство и неравенство. Для операции not используйте первое число.
# Продумайте в каком виде получать ввод от пользователя для логического значения.
#
# Пример вывода:
#
# Enter first value: <value1>
# Enter second value: <value1>
# and: True
# or: True
# not: False
# equal: False
# not equal: True

first = input("Enter first value (True/False): ")
second = input("Enter second value (True/False): ")

if first == "True":
    a = True
else:
    a = False

if second == "True":
    b = True
else:
    b = False

print("and:", a and b)
print("or:", a or b)
print("not:", not a)
print("equal:", a == b)
print("not equal:", a != b)

#task #2
# Проверка условий
# Напишите программу, которая принимает на вход логические значения двух переменных (свет включён и окно открыто) и проверяет:
# Оба ли условия выполнены.
# Хотя бы одно из условий выполнено.
#
# Пример вывода:
# Свет включён? True
# Окно открыто? False
# Оба условия выполнены? False
# Хотя бы одно условие выполнено? True

light_input = input("Свет включён? (True/False): ")
window_input = input("Окно открыто? (True/False): ")

light = light_input == "True"
window = window_input == "True"

print("Оба условия выполнены?", light and window)
print("Хотя бы одно условие выполнено?", light or window)

# task #3
#  Стоимость мобильного тарифа
# Напишите программу для расчёта стоимости использования мобильного тарифа:
# Базовая стоимость: 30 евро.
# Каждый мегабайт интернета сверх 500 МБ стоит 0.2 евро.
# Программа должна запросить у пользователя количество использованных мегабайтов и вывести сколько всего он заплатил (базовый и переплата).
# Пример вывода:
# Введите использованные мегабайты: 510
# Общая стоимость: 32.0

mg = int(input("Введиие использованные мегабайты: "))

if mg <= 500:
    print('Общая стоимость: 30 евро')
else:
    print('Общая стоимость:', ((mg - 500) * 0.2) + 30 , 'евро')




