# num = input('Введите четырехзначное число: ')
# sum = int(num[0]) + int(num[1]) + int(num[2]) + int(num[3])
# print('Сумма цифр числа: ' , sum)

# a = int(input('Введите первое число: '))
# b = int(input('Введите второе число: '))
#
# print('Результат:',int(a * b),'-',int(a),'-',int(b), sep="")

# a = int(input('Введите первое число: '))
# b = int(input('Введите второе число: '))
#
# c = int(a / b) #       целочисленное деление
# d = int(a - b * c) #   остаток от деления
#
# print('Остаток от деления:',  d )
# print('Целочисленное деление:', c) # c двумя Принтами :D

a = int(input('Введите первое число: '))
b = int(input('Введите второе число: '))

c = int(a / b) #       целочисленное деление
d = int(a - b * c) #   остаток от деления

print('Остаток от деления:',  d,  '\nЦелочисленное деление:', c) # с одним Принтом :D